analyr/assignment/assignment1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-24 六 10:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>定量研究方法课程作业1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="厦门大学公共事务学院" />
</head>
<body>
<div id="content">
<h1 class="title">定量研究方法课程作业1</h1>
<div id="outline-container-org7c6fc9c" class="outline-2">
<h2 id="org7c6fc9c"><span class="section-number-2">1</span> 问题</h2>
<div class="outline-text-2" id="text-1">
<p>
第一部分：（来源：Gelman and Hill 2007 第2章课后习题，增加部分提示）
</p>
<ol class="org-ol">
<li><p>
The following are the proportions of girl births in Vienna for each month in 1908 and 1909 (out of an average of 3900 births per month):
</p>

<p>
.4777 .4875 .4859 .4754 .4874 .4864 .4813 .4787 .4895 .4797 .4876 .4859 .4857 .4907 .5010 .4903 .4860 .4911 .4871 .4725 .4822 .4870 .4823 .4973 
</p>

<p>
von Mises (1957) used these proportions to claim that the sex ratios were less variable than would be expected by chance. 
</p>

<p>
(a) Compute the standard deviation of these proportions and compare to the standard deviation that would be expected if the sexes of babies were independently decided with a constant probability over the 24-month period. 
</p>

<p>
(b) The actual and theoretical standard deviations from (a) differ, of course. Is this difference statistically significant? (Hint: \((n-1)s^2 /\sigma^2 \sim \chi^2 (n-1) \)) 
</p></li>

<li><p>
Demonstration of the Central Limit Theorem: let x = x1 + · · · + x20, the sum of 20 independent Uniform(0,1) random variables. In R, create 1000 simulations of x and plot their histogram. On the histogram, overlay a graph of the normal density function. Comment on any differences between the histogram and the curve. 
</p>

<p>
(Hint: the R function for getting 20 random values from uniform distribution with a starting point 0 and an ending point 1 is runif(20); you can use dnorm() to get a normal density function and use lines() to draw it)
</p></li>

<li><p>
Distribution of averages and differences: the heights of men in the United States are approximately normally distributed with mean 69.1 inches and standard deviation 2.9 inches. The heights of women are approximately normally distributed with mean 63.7 inches and standard deviation 2.7 inches. Let x be the average height of 100 randomly sampled men, and y be the average height of 100 randomly sampled women. In R, create 1000 simulations of x − y and plot their histogram. Using the simulations, compute the mean and standard deviation of the distribution of x − y and compare to their exact values. 
</p>

<p>
(Hint: you can use rnorm(100, mean=69.1, sd=2.9) to get 100 simulated male random sample)
</p></li>
</ol>

<p>
第二部分：
</p>
<ol class="org-ol">
<li>在<a href="http://cgss.ruc.edu.cn/">中国综合社会调查网站</a>上下载cgss2017的数据（spss版本）、问卷和编码表。</li>
<li>在Rstudio中将数据导入，选择编号（id）、城乡（isurban）、居住省份（s41）、个人全年总收入（A8a）、出生年份（a31）、性别（A2）、教育程度（A7a）、政治面貌（A10）、工作年限（A59c）、工作经历及状态（A58）、父亲教育程度（A89b）、母亲教育程度（A90b）、父亲的工作单位类型（A89g）、母亲的工作单位类型（A90g）等变量构成新的工作数据集cgssincome2017，再根据城乡（isurban）变量选取城市的被调查对象（取值为1）并保存。</li>
<li>新建一个项目，载入cgssincome2017数据集，将出生年份转化为年龄（2017年），教育程度（本人、父母）重新进行编码转化为教育年限，政治面貌重新进行编码转化为是否党员。并且设定所有的缺失值为NA（CGSS往年设定为-8是无法回答；-3拒绝回答；-2是不知道；-1是不适用，请自行确认2017年数据是否依然如此！），最后成行删除掉具有缺失值的观测（建议使用cgssincome &lt;- na.omit(cgssincome)）。</li>
</ol>
<p>
注意：以上步骤如果采用菜单方式载入，haven包会默认给变量添加值标签，应采用zap_labels函数去除值标签，否则有些函数无法使用，如cgssincome &lt;- zap_labels(cgssincome)
</p>
<ol class="org-ol">
<li>将性别、是否党员转化为类别变量（因子factor函数），计算男女党员的交叉表; 制作收入的直方图(注意用参数breaks多分割一些区间)，收入是正态分布吗？如何让它变得更像正态分布？制作收入的箱线图，选取收入小于15万的观测再试试看；制作男女收入对比箱线图，收入存在性别差异吗？</li>
<li>计算在置信水平为95%的条件下，居民收入的置信区间。</li>
<li>假设有人提出2017年全国居民年平均收入为5万块，那么在0.05的显著性水平下，cgss的样本结果和这一提法一致吗？</li>
<li>计算男性与女性的平均收入，在95%的置信水平下，收入是否存在性别差异？</li>
<li>检验被调查者的父亲与母亲教育程度是否有差异？</li>
</ol>
</div>
</div>
<div id="outline-container-org11846f1" class="outline-2">
<h2 id="org11846f1"><span class="section-number-2">2</span> 第二部分数据 （第1-2步整理后数据，供参考，如无法独立完成第1-2步，可以载入后继续后面的分析）</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./cgssincome2017.RData">cgssincome2017数据</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 厦门大学公共事务学院</p>
<p class="date">Created: 2020-10-24 六 10:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
